dependencies/OpenFOAM/tutorials/compressible/rhoPimpleFoam/RAS/TJunctionAverage/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet1
    {
        type            calculated;
        value           uniform 0;
    }

    outlet2
    {
        type            calculated;
        value           uniform 0;
    }

    defaultFaces
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
